logs/kourier-defaults/load-test-always.log
{"level":"info","ts":1694153924.776021,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/09/08 06:18:44 Starting the load test.
2023/09/08 06:19:45 All pods are done (scaled to zero) or terminating after 1m0.000491063s
Requests      [total, rate, throughput]         719998, 2000.00, 1996.04
Duration      [total, attack, wait]             6m0s, 6m0s, 102.442ms
Latencies     [min, mean, 50, 90, 95, 99, max]  147.955µs, 121.695ms, 102.042ms, 102.707ms, 102.976ms, 145.379ms, 5.53s
Bytes In      [total, mean]                     17269322, 23.99
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           99.83%
Status Codes  [code:count]                      200:718776  503:1222  
Error Set:
503 Service Unavailable
2023/09/08 06:25:45 SLA 1 passed. P95 latency is in 100-115ms time range
2023/09/08 06:25:45 SLA 2 passed. Max latency is below 10s
2023/09/08 06:25:45 Shutting down InfluxReporter
2023/09/08 06:25:45 SLA 3 failed. Errors occurred: 1